[
    {
        "id": 1,
        "date": "2026-01-30",
        "title": "Mwithiga Labs Online: The Seeker's Command Center",
        "category": "Lab Update",
        "excerpt": "Today marks the launch of Mwithiga Labs. A unified hub for my PR and Cybersecurity projects, built on the 'Emerald Seeker' design system.",
        "content": "Today marks the launch of Mwithiga Labs. A unified hub for my PR and Cybersecurity projects, built on the 'Emerald Seeker' design system. This isn't just a portfolio; it's a living workspace where I fuse communication strategy with technical security."
    },
    {
        "id": 2,
        "date": "2026-01-29",
        "title": "Dispatch v1.2: Solving the Connection Friction",
        "category": "Tool Evolution",
        "excerpt": "Evolving the Email Assistant into Dispatch. Adding phone and social harvesting to create a true one-click connection portal.",
        "content": "A case study on how Dispatch evolved from a simple email harvester into a professional connection engine. By adding phone number and social media link harvesting (Instagram, Twitter, LinkedIn), we've reduced the friction of professional outreach significantly."
    },
    {
        "id": 3,
        "date": "2026-02-04",
        "title": "Incident 001: Hardening the SSH Gateway",
        "category": "Infrastructure Security",
        "excerpt": "A hands-on case study in moving beyond defaults. Challenges in repository conflicts (Kali vs Ubuntu) and port-binding nuances.",
        "content": "In this technical deep-dive, we moved a server from the default, vulnerable state to a hardened perimeter. <b>The Mission:</b> Disable root login, change the default port to 2222, and limit authentication attempts. <br><br><b>The Challenges:</b> We faced a 'FrankenDebian' repository conflict between Kali and Ubuntu sources on the host, which taught us the importance of environment isolation (VirtualBox). We also overcame a manual save issue in nano, confirming that in security, <i>intent is not configuration until it is verified.</i> <br><br><b>The Solution:</b> Repository cleanup, VM isolation, and use of 'ss' radar for final port verification. The gateway is now locked."
    }
]